# GetDeletedElementIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentDifference..::..GetDeletedElementIds Method
DocumentDifference Class See Also
---
Deleted element id collection. For non-worksharing models, this will always be an empty collection.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public ISet<ElementId> GetDeletedElementIds()
```

Visual Basic
---
```text
Public Function GetDeletedElementIds As ISet(Of ElementId)
```

Visual C++
---
```text
public:
ISet<ElementId^>^ GetDeletedElementIds()
```

# See Also
DocumentDifference Class
Autodesk.Revit.DB Namespace